In [1]:
%%bash
if test -f patents_db.sq3; then
  rm patents_db.sq3
fi
cat citations_short.csv | sqlite3 patents_db.sq3 ".mode csv" ".import /dev/stdin citations"
cat patents_short.csv | sqlite3 patents_db.sq3 ".mode csv" ".import /dev/stdin patents"

In [2]:
%load_ext sql
%sql sqlite:///patents_db.sq3

'Connected: @patents_db.sq3'

In [6]:
%%sql
SELECT * from patents as p;

 * sqlite:///patents_db.sq3
Done.

[('111', '2000', 'CO'),
 ('222', '2001', 'TX'),
 ('333', '2002', 'CO'),
 ('444', '2003', 'PA'),
 ('555', '2004', 'CO'),
 ('666', '2005', 'PA')]

In [7]:
%%sql
SELECT * from citations;

 * sqlite:///patents_db.sq3
Done.

[('111', '222'),
 ('111', '333'),
 ('111', '555'),
 ('222', '555'),
 ('666', '444'),
 ('666', '555')]

In [5]:
%%sql
SELECT * from citations c
JOIN patents p1
ON c.CITING==p1.PATENT

 * sqlite:///patents_db.sq3
Done.

[('111', '222', '111', '2000', 'CO'),
 ('111', '333', '111', '2000', 'CO'),
 ('111', '555', '111', '2000', 'CO'),
 ('222', '555', '222', '2001', 'TX'),
 ('666', '444', '666', '2005', 'PA'),
 ('666', '555', '666', '2005', 'PA')]

In [8]:
%%sql
SELECT * from patents p1
JOIN citations c
ON p1.PATENT==c.CITING

 * sqlite:///patents_db.sq3
Done.

[('111', '2000', 'CO', '111', '222'),
 ('111', '2000', 'CO', '111', '333'),
 ('111', '2000', 'CO', '111', '555'),
 ('222', '2001', 'TX', '222', '555'),
 ('666', '2005', 'PA', '666', '444'),
 ('666', '2005', 'PA', '666', '555')]

We'll stop before doing multiple joins.  But, use the below (and even the above) cells to play with SQL on a smaller dataset.